#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`


```terraform
aws_iam_policy.pichincha_lambdas: Refreshing state... [id=arn:aws:iam::724404050210:policy/pichincha_lambdas_policy_client]
aws_iam_role.pichincha_lambdas: Refreshing state... [id=pichincha_role]
data.aws_caller_identity.current: Reading...
aws_ecr_repository.post["devops"]: Refreshing state... [id=pichincha_devops]
aws_api_gateway_rest_api.pichincha_apigw: Refreshing state... [id=8wpxfzdwe3]
data.aws_caller_identity.current: Read complete after 0s [id=724404050210]
aws_ecr_repository_policy.post["devops"]: Refreshing state... [id=pichincha_devops]
aws_api_gateway_resource.pichincha_resource["devops"]: Refreshing state... [id=cnq8fv]
aws_api_gateway_method.pichincha_method["devops"]: Refreshing state... [id=agm-8wpxfzdwe3-cnq8fv-POST]
aws_api_gateway_method_response.method_response_client["devops"]: Refreshing state... [id=agmr-8wpxfzdwe3-cnq8fv-POST-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_api_gateway_method.pichincha_method["devops"] has changed
  ~ resource "aws_api_gateway_method" "pichincha_method" {
      + authorization_scopes = []
        id                   = "agm-8wpxfzdwe3-cnq8fv-POST"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = "8wpxfzdwe3"
      + stage_description = "Deployed at b898626b228515cf159ad5f1cd93c4c43f59bd09"
      + stage_name        = "develop"
    }

  # aws_api_gateway_integration.pichincha_integration["devops"] will be created
  + resource "aws_api_gateway_integration" "pichincha_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "cnq8fv"
      + rest_api_id             = "8wpxfzdwe3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration_response.integration_response_client["devops"] will be created
  + resource "aws_api_gateway_integration_response" "integration_response_client" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "cnq8fv"
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = "'*'"
        }
      + rest_api_id         = "8wpxfzdwe3"
      + status_code         = "200"
    }

  # aws_lambda_function.lambda_functions_client["devops"] will be created
  + resource "aws_lambda_function" "lambda_functions_client" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "pichicha-devops-develop"
      + id                             = (known after apply)
      + image_uri                      = "724404050210.dkr.ecr.us-east-1.amazonaws.com/s4bps-business-central:businesscentral-develop-499f352-20221222-002724722"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::724404050210:role/pichincha_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.apigw_lambda_client["devops"] will be created
  + resource "aws_lambda_permission" "apigw_lambda_client" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pichincha-devops-develop"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:724404050210:8wpxfzdwe3/*/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "bucket_client_name" but a
value was found in file "../variables/develop.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```


*Pusher: @santacruzpedro, Action: `pull_request`, Working Directory: `terraform/`, Workflow: `CI Terraform`*